const questions = [

{
category:"材料",
question:"セメントが硬化する主な反応は？",
choices:[
"炭酸化",
"水和反応",
"酸化",
"蒸発"
],
answer:1,
explanation:"セメントは水和反応で硬化します。"
},

{
category:"施工",
question:"締固め不足で発生しやすいものは？",
choices:[
"ジャンカ",
"高強度化",
"中性化停止",
"塩害防止"
],
answer:0,
explanation:"締固め不足でジャンカが発生します。"
},

{
category:"材料",
question:"セメントに関する記述のうち、適当なものはどれか。",
choices:[
"高炉セメントの密度は、高炉スラグの分量が多いほど、大きくなる。",
"クリンカーの主要成分は、酸化カルシウム、二酸化けい素、酸化アルミニウムおよび酸化第二鉄である。",
"セメントが風化すると、新鮮なセメントと比較して強熱減量は減少し、密度は大きくなる。",
"セメント中のせっこうは、けい酸化カルシウムの水和を抑制する役割を果たしている。"
],
answer:1,
explanation:"クリンカーの主要成分は酸化カルシウム、二酸化けい素、酸化アルミニウムおよび酸化第二鉄である。これら４つで95%を占めている。"
},

{
category:"材料",
question:"表乾状態の細骨材500ｇを質量300ｇの容器に入れて、105℃の乾燥機内で一定の質量となるまで乾燥させた後、室温迄冷やし、合計質量を測定したところ787.5ｇだった。粗骨材の吸水率はどれか?",
choices:[
"2.44%",
"2.50%",
"2.56%",
"2.62%"
],
answer:2,
explanation:"500-（787.5-300）/787.5-300×100=2.56"
},
  
{
category:"材料",
question:"骨材の品質とコンクリートの性質について述べた次の記述のうち、不適当なものはどれか。",
choices:[
"JIS A 1122（硫酸ナトリウムによる骨材の安定性試験方法）で損失質量分率が小さい骨材を用いると、耐熱性が向上する。",
"JIS A 5505（コンクリート用砕石及び砕砂）における粒形判定実績率が大きい骨材を用いると、単位水量を少なく出来る。",
"JIS A 1137（骨材中に含まれる粘土塊量の試験方法）で粘土塊量の多い骨材は、強度や耐久性を低下させる。",
"JIS A 1105（細骨材の有機不純物試験方法）で標準色液と比べて色が濃くなる骨材は、凝結や硬化を妨げるおそれがある。"
],
answer:0,
explanation:"セメントは水和反応で硬化します。"
},
  
];
