const questions = [

{
category:"材料",
question:"セメントが硬化する主な反応は？",
choices:[
"炭酸化",
"水和反応",
"酸化",
"蒸発"
],
answer:1,
explanation:"セメントは水和反応で硬化します。"
},

{
category:"施工",
question:"締固め不足で発生しやすいものは？",
choices:[
"ジャンカ",
"高強度化",
"中性化停止",
"塩害防止"
],
answer:0,
explanation:"締固め不足でジャンカが発生します。"
},

{
category:"材料",
question:"セメントに関する記述のうち、適当なものはどれか。",
choices:[
"高炉セメントの密度は、高炉スラグの分量が多いほど、大きくなる。",
"クリンカーの主要成分は、酸化カルシウム、二酸化けい素、酸化アルミニウムおよび酸化第二鉄である。",
"セメントが風化すると、新鮮なセメントと比較して強熱減量は減少し、密度は大きくなる。",
"セメント中のせっこうは、けい酸化カルシウムの水和を抑制する役割を果たしている。"
],
answer:1,
explanation:"クリンカーの主要成分は問題の通り。これら４つで95%を占めている。"
},
  
];
